results_mongodb/workloadA_load1.txt
/usr/bin/java  -classpath /home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/conf:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/lib/core-0.17.0.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/logback-core-1.1.2.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar site.ycsb.Client -load -db site.ycsb.db.MongoDbClient -s -P workloads/workloada -p mongodb.url=mongodb://127.0.0.1:27017/ycsb?w=1
mongo client connection created with mongodb://127.0.0.1:27017/ycsb?w=1
[OVERALL], RunTime(ms), 12896
[OVERALL], Throughput(ops/sec), 77.54342431761786
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 37
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.2869106699751861
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 37
[TOTAL_GC_TIME_%], Time(%), 0.2869106699751861
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3177.0
[CLEANUP], MinLatency(us), 3176
[CLEANUP], MaxLatency(us), 3177
[CLEANUP], 95thPercentileLatency(us), 3177
[CLEANUP], 99thPercentileLatency(us), 3177
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 12214.08
[INSERT], MinLatency(us), 481
[INSERT], MaxLatency(us), 11149311
[INSERT], 95thPercentileLatency(us), 2671
[INSERT], 99thPercentileLatency(us), 5899
[INSERT], Return=OK, 1000